//პრიმიტიული მნიშვნელობები — ესენი არიან მონაცემების მარტივი ტიპები რომლებიც ინახავენ ერთ მნიშვნელობას
//ისინი ინახებიან stack მეხსიერებაში და პირდაპირ გადადის მნიშვნელობა როცა ახალ ცვლადს ვანიჭებთ
let a = 10;
let b = a; 
b = 20;

console.log(a); 
console.log(b); 

//კომპლექსური მნიშვნელობები — ესენია ობიექტური ტიპები რომლებიც ინახავენ ბევრ მონაცემს ერთად (მაგ ობიექტი მასივი ფუნქცია)
//ისინი ინახებიან heap მეხსიერებაში ხოლო ცვლადი stack-ზე მხოლოდ მის მისამართს (referencesს) ინახავს.

let user1 = { name: "NATALI" };
let user2 = user1; 

user2.name = "ELENE";

console.log(user1.name); 
console.log(user2.name); 